PROC 0
CONTROL NOMSG
/* Replace YOURID.SQLITE.MYDB and YOURID.SQLITE.MYJRN. */
FREE FI(SQLDB SQLJRN SQLTMP SQLTJR)
ALLOC FI(SQLDB) DA('YOURID.SQLITE.MYDB') SHR
IF &LASTCC NE 0 THEN DO
  WRITE ERROR: CANNOT ALLOCATE YOURID.SQLITE.MYDB
  EXIT CODE(&LASTCC)
END
ALLOC FI(SQLJRN) DA('YOURID.SQLITE.MYJRN') SHR
IF &LASTCC NE 0 THEN DO
  WRITE ERROR: CANNOT ALLOCATE YOURID.SQLITE.MYJRN
  FREE FI(SQLDB)
  EXIT CODE(&LASTCC)
END
ALLOC FI(SQLTMP) DA('IBMUSER.SQLITE.D534TMP') SHR
IF &LASTCC NE 0 THEN DO
  WRITE ERROR: CANNOT ALLOCATE IBMUSER.SQLITE.D534TMP
  FREE FI(SQLDB SQLJRN)
  EXIT CODE(&LASTCC)
END
ALLOC FI(SQLTJR) DA('IBMUSER.SQLITE.D534TJR') SHR
IF &LASTCC NE 0 THEN DO
  WRITE ERROR: CANNOT ALLOCATE IBMUSER.SQLITE.D534TJR
  FREE FI(SQLDB SQLJRN SQLTMP)
  EXIT CODE(&LASTCC)
END
CALL 'IBMUSER.SQLITE.D534.LOAD(SQLI534)'
SET RC = &LASTCC
FREE FI(SQLDB SQLJRN SQLTMP SQLTJR)
EXIT CODE(&RC)
