PROC 0
CONTROL NOMSG
/* Replace YOURID.SQLITE.MYDB and YOURID.SQLITE.MYJRN. */
FREE FI(SQLDB SQLJRN)
ALLOC FI(SQLDB) DA('YOURID.SQLITE.MYDB') SHR
IF &LASTCC NE 0 THEN DO
  WRITE ERROR: CANNOT ALLOCATE YOURID.SQLITE.MYDB
  EXIT CODE(&LASTCC)
END
ALLOC FI(SQLJRN) DA('YOURID.SQLITE.MYJRN') SHR
IF &LASTCC NE 0 THEN DO
  WRITE ERROR: CANNOT ALLOCATE YOURID.SQLITE.MYJRN
  FREE FI(SQLDB)
  EXIT CODE(&LASTCC)
END
CALL 'IBMUSER.SQLITE.D534.LOAD(SQLI534)'
SET RC = &LASTCC
FREE FI(SQLDB SQLJRN)
EXIT CODE(&RC)
