PROC 0
CONTROL NOMSG
FREE FI(SQLDB SQLJRN)
ALLOC FI(SQLDB) DA('IBMUSER.SQLITE.D372DB') SHR
IF &LASTCC NE 0 THEN DO
  WRITE ERROR: CANNOT ALLOCATE IBMUSER.SQLITE.D372DB
  EXIT CODE(&LASTCC)
END
ALLOC FI(SQLJRN) DA('IBMUSER.SQLITE.D372JRN') SHR
IF &LASTCC NE 0 THEN DO
  WRITE ERROR: CANNOT ALLOCATE IBMUSER.SQLITE.D372JRN
  FREE FI(SQLDB)
  EXIT CODE(&LASTCC)
END
CALL 'IBMUSER.SQLITE.D372.LOAD(SQLI372)'
SET RC = &LASTCC
FREE FI(SQLDB SQLJRN)
EXIT CODE(&RC)
