PROC 0
CONTROL NOMSG
FREE FI(SQLDB SQLJRN)
ALLOC FI(SQLDB) DA('IBMUSER.SQLITE.D534DB') SHR
IF &LASTCC NE 0 THEN DO
  WRITE ERROR: CANNOT ALLOCATE IBMUSER.SQLITE.D534DB
  EXIT CODE(&LASTCC)
END
ALLOC FI(SQLJRN) DA('IBMUSER.SQLITE.D534JRN') SHR
IF &LASTCC NE 0 THEN DO
  WRITE ERROR: CANNOT ALLOCATE IBMUSER.SQLITE.D534JRN
  FREE FI(SQLDB)
  EXIT CODE(&LASTCC)
END
CALL 'IBMUSER.SQLITE.D534.LOAD(SQLI534)'
SET RC = &LASTCC
FREE FI(SQLDB SQLJRN)
EXIT CODE(&RC)
