PROC 0
CONTROL NOMSG
FREE FI(SQLDB SQLJRN SQLBAK SQLBJR)
ALLOC FI(SQLDB) DA('IBMUSER.SQLITE.D534DB') SHR
IF &LASTCC NE 0 THEN GOTO ADMFAIL
ALLOC FI(SQLJRN) DA('IBMUSER.SQLITE.D534JRN') SHR
IF &LASTCC NE 0 THEN GOTO ADMFAIL
ALLOC FI(SQLBAK) DA('IBMUSER.SQLITE.D534BAK') SHR
IF &LASTCC NE 0 THEN GOTO ADMFAIL
ALLOC FI(SQLBJR) DA('IBMUSER.SQLITE.D534BJR') SHR
IF &LASTCC NE 0 THEN GOTO ADMFAIL
CALL 'IBMUSER.SQLITE.D534.LOAD(SQLI534)'
SET RC = &LASTCC
FREE FI(SQLDB SQLJRN SQLBAK SQLBJR)
EXIT CODE(&RC)
ADMFAIL: +
SET RC = &LASTCC
WRITE ERROR: CANNOT ALLOCATE SQLITE ADMIN RRDS FILES, RC=&RC
FREE FI(SQLDB SQLJRN SQLBAK SQLBJR)
EXIT CODE(&RC)
