PROC 0
CONTROL NOMSG
FREE FI(SQLMAIN SQLMJRN SQLTMP SQLTJR)
ALLOC FI(SQLMAIN) DA('IBMUSER.SQLITE.D534DB') SHR
IF &LASTCC NE 0 THEN DO
  WRITE ERROR: CANNOT ALLOCATE IBMUSER.SQLITE.D534DB
  EXIT CODE(&LASTCC)
END
ALLOC FI(SQLMJRN) DA('IBMUSER.SQLITE.D534JRN') SHR
IF &LASTCC NE 0 THEN DO
  WRITE ERROR: CANNOT ALLOCATE IBMUSER.SQLITE.D534JRN
  FREE FI(SQLMAIN)
  EXIT CODE(&LASTCC)
END
ALLOC FI(SQLTMP) DA('IBMUSER.SQLITE.D534TMP') SHR
IF &LASTCC NE 0 THEN DO
  WRITE ERROR: CANNOT ALLOCATE IBMUSER.SQLITE.D534TMP
  FREE FI(SQLMAIN SQLMJRN)
  EXIT CODE(&LASTCC)
END
ALLOC FI(SQLTJR) DA('IBMUSER.SQLITE.D534TJR') SHR
IF &LASTCC NE 0 THEN DO
  WRITE ERROR: CANNOT ALLOCATE IBMUSER.SQLITE.D534TJR
  FREE FI(SQLMAIN SQLMJRN SQLTMP)
  EXIT CODE(&LASTCC)
END
CALL 'IBMUSER.SQLITE.D534.LOAD(SQLI534)' 'SQLMAIN:SQLMJRN'
SET RC = &LASTCC
FREE FI(SQLMAIN SQLMJRN SQLTMP SQLTJR)
EXIT CODE(&RC)
