PROC 0
CONTROL NOMSG
FREE FI(SQLDB SQLJRN SQLBAK SQLBJR)
ALLOC FI(SQLDB) DA('IBMUSER.SQLITE.RRDS') SHR
IF &LASTCC NE 0 THEN GOTO ADMFAIL
ALLOC FI(SQLJRN) DA('IBMUSER.SQLITE.JOURNAL') SHR
IF &LASTCC NE 0 THEN GOTO ADMFAIL
ALLOC FI(SQLBAK) DA('IBMUSER.SQLITE.BACKUP') SHR
IF &LASTCC NE 0 THEN GOTO ADMFAIL
ALLOC FI(SQLBJR) DA('IBMUSER.SQLITE.BACKJRN') SHR
IF &LASTCC NE 0 THEN GOTO ADMFAIL
CALL 'IBMUSER.SQLITE.LOAD(SQLITSO)'
SET RC = &LASTCC
FREE FI(SQLDB SQLJRN SQLBAK SQLBJR)
EXIT CODE(&RC)
ADMFAIL: +
SET RC = &LASTCC
WRITE ERROR: CANNOT ALLOCATE SQLITE ADMIN RRDS FILES, RC=&RC
FREE FI(SQLDB SQLJRN SQLBAK SQLBJR)
EXIT CODE(&RC)
