PROC 0
CONTROL NOMSG
FREE FI(SQLDB SQLJRN)
ALLOC FI(SQLDB) DA('IBMUSER.SQLITE.TESTDB') SHR
IF &LASTCC NE 0 THEN DO
  WRITE ERROR: CANNOT ALLOCATE IBMUSER.SQLITE.TESTDB
  EXIT CODE(&LASTCC)
END
ALLOC FI(SQLJRN) DA('IBMUSER.SQLITE.TESTJRN') SHR
IF &LASTCC NE 0 THEN DO
  WRITE ERROR: CANNOT ALLOCATE IBMUSER.SQLITE.TESTJRN
  FREE FI(SQLDB)
  EXIT CODE(&LASTCC)
END
CALL 'IBMUSER.SQLITE.LOAD(SQLITSO)'
SET RC = &LASTCC
FREE FI(SQLDB SQLJRN)
EXIT CODE(&RC)
