//SQLKBLD  JOB (ACCT),'SQLK COB',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//JOBPROC  DD DSN=KICKS.KICKSSYS.V1R5M0.PROCLIB,DISP=SHR
//BUILD    EXEC K2KCOBCL
//COPY.SYSUT1 DD DSN=IBMUSER.SQLITE.SOURCE(SQLKSRCH),DISP=SHR
//LKED.SYSLIB DD DISP=SHR,DSN=SYS1.COBLIB
//         DD DISP=SHR,DSN=KICKS.KICKSSYS.V1R5M0.SKIKLOAD
//LKED.SYSLMOD DD DISP=SHR,DSN=IBMUSER.SQLITE.KLOAD(SQLKSRCH)
//LKED.SYSIN DD DISP=SHR,DSN=IBMUSER.SQLITE.BRG80
//         DD *
 INCLUDE SKIKLOAD(KIKCOBGL)
 ENTRY SQLKSRCH
 NAME SQLKSRCH(R)
/*
