//SQLDMAP  JOB (ACCT),'SQLD MAP',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//JOBPROC  DD DSN=KICKS.KICKSSYS.V1R5M0.PROCLIB,DISP=SHR
//MAP      EXEC KIKMAPS,MAPNAME=SQLDMAP
//COPY.SYSUT1 DD DSN=IBMUSER.SQLITE.SOURCE(SQLDMAP),DISP=SHR
//LINKMAP.SYSLMOD DD DSN=IBMUSER.SQLITE.KLOAD(SQLDMAP),DISP=SHR
//COBMAP.SYSPRINT DD DSN=KICKS.KICKS.V1R5M0.COBCOPY(SQLDMAP),
// DISP=SHR
//GCCMAP.SYSPRINT DD DUMMY
