//SQLESTST JOB (A),'EXEC SQL',CLASS=A,MSGCLASS=H
//GO       EXEC PGM=KIKSIP1$,REGION=8192K,TIME=1,
// PARM='SIT=B$ PCT=SQ PPT=SQ ICVR=0'
//STEPLIB  DD DSN=IBMUSER.SQLITE.D534.LOAD,DISP=SHR
//         DD DSN=KICKS.KICKSSYS.V1R5M0.SKIKLOAD,DISP=SHR
//SKIKLOAD DD DSN=IBMUSER.SQLITE.KLOAD,DISP=SHR
//         DD DSN=KICKS.KICKSSYS.V1R5M0.SKIKLOAD,DISP=SHR
//KIKRPL   DD DSN=IBMUSER.SQLITE.KLOAD,DISP=SHR,
// DCB=BLKSIZE=32760
//         DD DSN=KICKS.KICKSSYS.V1R5M0.KIKRPL,DISP=SHR
//SQLDB    DD DSN=IBMUSER.SQLITE.TESTDB,DISP=SHR
//SQLJRN   DD DSN=IBMUSER.SQLITE.TESTJRN,DISP=SHR
//SYSPRINT DD SYSOUT=*,DCB=(RECFM=F,BLKSIZE=80)
//SYSTERM  DD SYSOUT=*,DCB=(RECFM=F,BLKSIZE=80)
//SYSOUT   DD SYSOUT=*,DCB=BLKSIZE=132
//CRLPOUT  DD SYSOUT=*,DCB=(RECFM=F,BLKSIZE=132)
//TRANDUMP DD SYSOUT=*,DCB=(RECFM=F,BLKSIZE=132)
//SYSUDUMP DD SYSOUT=*
//AUXTRC   DD SYSOUT=*,DCB=(RECFM=V,BLKSIZE=2000)
//SYSIN    DD DUMMY,DCB=(RECFM=F,BLKSIZE=80)
//CRLPIN   DD *,DCB=BLKSIZE=80
SQLD<ENTER>
1<ENTER>
/*
