//SQLKMAP  JOB (ACCT),'SQLK MAP',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//JOBPROC  DD DSN=KICKS.KICKSSYS.V1R5M0.PROCLIB,DISP=SHR
//MAP      EXEC KIKMAPS,MAPNAME=SQLKMAP
//COPY.SYSUT1 DD DSN=IBMUSER.SQLITE.SOURCE(SQLKMAP),DISP=SHR
//LINKMAP.SYSLMOD DD DSN=IBMUSER.SQLITE.KLOAD(SQLKMAP),DISP=SHR
//COBMAP.SYSPRINT DD DSN=KICKS.KICKS.V1R5M0.COBCOPY(SQLKMAP),
// DISP=SHR
//GCCMAP.SYSPRINT DD DUMMY
