//SQLKPCT  JOB (ACCT),'SQLK PCT',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//ASM      EXEC PGM=IFOX00,PARM='DECK,NOLIST'
//SYSLIB   DD DSN=SYS1.MACLIB,DISP=SHR
//         DD DSN=KICKS.KICKSSYS.V1R5M0.MACLIB,DISP=SHR
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT2   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT3   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSPRINT DD SYSOUT=*
//SYSLIN   DD DUMMY
//SYSPUNCH DD DSN=&&OBJSET,UNIT=SYSDA,SPACE=(80,(200,200)),
// DISP=(NEW,PASS)
//SYSIN    DD *
         KIKPCT TYPE=INITIAL,SUFFIX=SQ
         KIKPCT TYPE=ENTRY,TRANSID=SQLS,PROGRAM=SQLKSRCH
         KIKPCT TYPE=ENTRY,TRANSID=SQLD,PROGRAM=SQLKDETL
         KIKPCT TYPE=ENTRY,TRANSID=KSSF,PROGRAM=KSSFPGM
         KIKPCT TYPE=ENTRY,TRANSID=KSGM,PROGRAM=KSGMPGM
         KIKPCT TYPE=ENTRY,TRANSID=K999,PROGRAM=K999PGM
         KIKPCT TYPE=FINAL
         END
/*
//LINK     EXEC PGM=IEWL,PARM='XREF,MAP,NCAL',COND=(0,NE,ASM)
//SYSLIN   DD DSN=&&OBJSET,DISP=(OLD,DELETE)
//SYSLMOD  DD DSN=IBMUSER.SQLITE.KLOAD(KIKPCTSQ),DISP=SHR
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSPRINT DD SYSOUT=*
