//SQLKPPT  JOB (ACCT),'SQLK PPT',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//ASM      EXEC PGM=IFOX00,PARM='DECK,NOLIST'
//SYSLIB   DD DSN=SYS1.MACLIB,DISP=SHR
//         DD DSN=KICKS.KICKSSYS.V1R5M0.MACLIB,DISP=SHR
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT2   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT3   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSPRINT DD SYSOUT=*
//SYSLIN   DD DUMMY
//SYSPUNCH DD DSN=&&OBJSET,UNIT=SYSDA,SPACE=(80,(200,200)),
// DISP=(NEW,PASS)
//SYSIN    DD *
         KIKPPT TYPE=INITIAL,SUFFIX=SQ
         KIKPPT TYPE=ENTRY,PROGRAM=SQLKSRCH,PGMLANG=CMDLVL
         KIKPPT TYPE=ENTRY,PROGRAM=SQLKMAP,USAGE=MAP
         KIKPPT TYPE=ENTRY,PROGRAM=SQLKDETL,PGMLANG=CMDLVL
         KIKPPT TYPE=ENTRY,PROGRAM=SQLDMAP,USAGE=MAP
         KIKPPT TYPE=ENTRY,PROGRAM=KSSFPGM,PGMLANG=CMDLVL
         KIKPPT TYPE=ENTRY,PROGRAM=KSGMPGM,PGMLANG=CMDLVL
         KIKPPT TYPE=ENTRY,PROGRAM=K999PGM,PGMLANG=CMDLVL
         KIKPPT TYPE=ENTRY,PROGRAM=KSGMHLP,PGMLANG=CMDLVL
         KIKPPT TYPE=ENTRY,PROGRAM=KSGMLIC,PGMLANG=CMDLVL
         KIKPPT TYPE=ENTRY,PROGRAM=KSGMAP,USAGE=MAP
         KIKPPT TYPE=ENTRY,PROGRAM=KSGMAPL,USAGE=MAP
         KIKPPT TYPE=FINAL
         END
/*
//LINK     EXEC PGM=IEWL,PARM='XREF,MAP,NCAL',COND=(0,NE,ASM)
//SYSLIN   DD DSN=&&OBJSET,DISP=(OLD,DELETE)
//SYSLMOD  DD DSN=IBMUSER.SQLITE.KLOAD(KIKPPTSQ),DISP=SHR
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSPRINT DD SYSOUT=*
