//SQLKSET  JOB (ACCT),'SQLK SET',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE IBMUSER.SQLITE.SOURCE PURGE
  IF LASTCC = 8 THEN SET MAXCC = 0
  DELETE IBMUSER.SQLITE.KLOAD PURGE
  IF LASTCC = 8 THEN SET MAXCC = 0
/*
//SOURCE   EXEC PGM=IEFBR14,COND=(0,NE)
//PDS      DD DSN=IBMUSER.SQLITE.SOURCE,DISP=(NEW,CATLG,DELETE),
// UNIT=SYSDA,SPACE=(TRK,(5,2,10)),
// DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=3200)
//KLOAD    EXEC PGM=IEFBR14,COND=(0,NE)
//PDS      DD DSN=IBMUSER.SQLITE.KLOAD,DISP=(NEW,CATLG,DELETE),
// UNIT=SYSDA,SPACE=(TRK,(10,5,20)),
// DCB=(DSORG=PO,RECFM=U,BLKSIZE=32760)
