         TITLE 'SQLITE KICKS PERSON DETAIL'
SQLDMAP  DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,                   X
               CTRL=FREEKB,TIOAPFX=YES
SQLDETL  DFHMDI SIZE=(24,80)
TITLE    DFHMDF POS=(1,20),LENGTH=40,ATTRB=(PROT,BRT),                 X
               INITIAL='*** SQLITE PERSON DETAIL / EDIT ***'
         DFHMDF POS=(3,2),LENGTH=3,ATTRB=PROT,INITIAL='ID:'
DID      DFHMDF POS=(3,6),LENGTH=5,ATTRB=(UNPROT,IC,FSET),             X
               HILIGHT=UNDERLINE
         DFHMDF POS=(3,14),LENGTH=5,ATTRB=PROT,INITIAL='NAME:'
DNAME    DFHMDF POS=(3,20),LENGTH=10,ATTRB=(UNPROT,FSET),              X
               HILIGHT=UNDERLINE
         DFHMDF POS=(3,34),LENGTH=5,ATTRB=PROT,INITIAL='CITY:'
DCITY    DFHMDF POS=(3,40),LENGTH=10,ATTRB=(UNPROT,FSET),              X
               HILIGHT=UNDERLINE
         DFHMDF POS=(3,54),LENGTH=4,ATTRB=PROT,INITIAL='AGE:'
DAGE     DFHMDF POS=(3,59),LENGTH=3,ATTRB=(UNPROT,FSET),               X
               HILIGHT=UNDERLINE
HDR      DFHMDF POS=(5,2),LENGTH=76,ATTRB=(PROT,BRT),                  X
               INITIAL='ORDER   ITEM              QTY        AMOUNT'
SEP      DFHMDF POS=(6,2),LENGTH=76,ATTRB=PROT,                        X
               INITIAL='----------------------------------------------'
ROW01    DFHMDF POS=(7,2),LENGTH=76,ATTRB=PROT
ROW02    DFHMDF POS=(8,2),LENGTH=76,ATTRB=PROT
ROW03    DFHMDF POS=(9,2),LENGTH=76,ATTRB=PROT
ROW04    DFHMDF POS=(10,2),LENGTH=76,ATTRB=PROT
ROW05    DFHMDF POS=(11,2),LENGTH=76,ATTRB=PROT
ROW06    DFHMDF POS=(12,2),LENGTH=76,ATTRB=PROT
ROW07    DFHMDF POS=(13,2),LENGTH=76,ATTRB=PROT
ROW08    DFHMDF POS=(14,2),LENGTH=76,ATTRB=PROT
ROW09    DFHMDF POS=(15,2),LENGTH=76,ATTRB=PROT
ROW10    DFHMDF POS=(16,2),LENGTH=76,ATTRB=PROT
INFO     DFHMDF POS=(19,2),LENGTH=76,ATTRB=(PROT,BRT)
KEYS     DFHMDF POS=(22,2),LENGTH=76,ATTRB=PROT,                       X
               INITIAL='LOAD=ENT SAVE=PF5 ADD=PF6 DEL=PF9/10 BACK=PF3'
MSG      DFHMDF POS=(24,2),LENGTH=76,ATTRB=(PROT,BRT)
         DFHMSD TYPE=FINAL
         END
