         TITLE 'SQLITE KICKS PEOPLE SEARCH'
SQLKMAP  DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,                   X
               CTRL=FREEKB,TIOAPFX=YES
SQLKSRH  DFHMDI SIZE=(24,80)
TITLE    DFHMDF POS=(1,20),LENGTH=40,ATTRB=(PROT,BRT),                 X
               INITIAL='*** SQLITE PEOPLE SEARCH FOR KICKS ***'
         DFHMDF POS=(3,3),LENGTH=5,ATTRB=PROT,INITIAL='NAME:'
SRNAME   DFHMDF POS=(3,10),LENGTH=10,ATTRB=(UNPROT,IC),                X
               HILIGHT=UNDERLINE
         DFHMDF POS=(3,27),LENGTH=5,ATTRB=PROT,INITIAL='CITY:'
SRCITY   DFHMDF POS=(3,34),LENGTH=10,ATTRB=UNPROT,                     X
               HILIGHT=UNDERLINE
HDR      DFHMDF POS=(5,2),LENGTH=76,ATTRB=(PROT,BRT),                  X
               INITIAL='ID | NAME | CITY | AGE'
SEP      DFHMDF POS=(6,2),LENGTH=76,ATTRB=PROT,                        X
               INITIAL='----------------------------------------'
ROW01    DFHMDF POS=(7,2),LENGTH=76,ATTRB=PROT
ROW02    DFHMDF POS=(8,2),LENGTH=76,ATTRB=PROT
ROW03    DFHMDF POS=(9,2),LENGTH=76,ATTRB=PROT
ROW04    DFHMDF POS=(10,2),LENGTH=76,ATTRB=PROT
ROW05    DFHMDF POS=(11,2),LENGTH=76,ATTRB=PROT
ROW06    DFHMDF POS=(12,2),LENGTH=76,ATTRB=PROT
ROW07    DFHMDF POS=(13,2),LENGTH=76,ATTRB=PROT
ROW08    DFHMDF POS=(14,2),LENGTH=76,ATTRB=PROT
ROW09    DFHMDF POS=(15,2),LENGTH=76,ATTRB=PROT
ROW10    DFHMDF POS=(16,2),LENGTH=76,ATTRB=PROT
INFO     DFHMDF POS=(19,2),LENGTH=76,ATTRB=(PROT,BRT)
KEYS     DFHMDF POS=(22,2),LENGTH=76,ATTRB=PROT,                       X
               INITIAL='ENTER=SEARCH  PF4=CLEAR  PF3=EXIT'
MSG      DFHMDF POS=(24,2),LENGTH=76,ATTRB=(PROT,BRT)
         DFHMSD TYPE=FINAL
         END
