PROC 0
SET KRC=12
CONTROL NOMSG NOFLUSH
FREE FI(SKIKLOAD KIKRPL SQLDB SQLJRN LICENSE SYSIN SYSTERM SYSPRINT)
FREE FI(SYSOUT SYSUDUMP TRANDUMP AUXTRC SYSI SYSO)
CONTROL MSG NOFLUSH
ATTRIB SQ80 RECFM(F) LRECL(80) BLKSIZE(80)
IF &LASTCC NE 0 THEN GOTO SQFAIL
ATTRIB SQ132 RECFM(F) LRECL(132) BLKSIZE(132)
IF &LASTCC NE 0 THEN GOTO SQFAIL
ATTRIB SQTRC RECFM(V) LRECL(2000) BLKSIZE(2004)
IF &LASTCC NE 0 THEN GOTO SQFAIL
ALLOC FI(SKIKLOAD) DA('IBMUSER.SQLITE.D534.LOAD' +
 'IBMUSER.SQLITE.KLOAD' 'KICKS.KICKSSYS.V1R5M0.SKIKLOAD') +
 SHR BLKSIZE(32760)
IF &LASTCC NE 0 THEN GOTO SQFAIL
ALLOC FI(KIKRPL) DA('IBMUSER.SQLITE.KLOAD' +
 'KICKS.KICKSSYS.V1R5M0.KIKRPL') SHR BLKSIZE(32760)
IF &LASTCC NE 0 THEN GOTO SQFAIL
ALLOC FI(SQLDB) DA('IBMUSER.SQLITE.TESTDB') SHR
IF &LASTCC NE 0 THEN GOTO SQFAIL
ALLOC FI(SQLJRN) DA('IBMUSER.SQLITE.TESTJRN') SHR
IF &LASTCC NE 0 THEN GOTO SQFAIL
ALLOC FI(LICENSE) +
 DA('KICKS.KICKSSYS.V1R5M0.DOC(LICENSE)') SHR
IF &LASTCC NE 0 THEN GOTO SQFAIL
ALLOC FI(SYSIN) DUMMY USING(SQ80)
IF &LASTCC NE 0 THEN GOTO SQFAIL
ALLOC FI(SYSTERM) DA(*) USING(SQ80)
IF &LASTCC NE 0 THEN GOTO SQFAIL
ALLOC FI(SYSPRINT) DA(*) USING(SQ80)
IF &LASTCC NE 0 THEN GOTO SQFAIL
ALLOC FI(SYSOUT) SYSOUT(A) USING(SQ132)
IF &LASTCC NE 0 THEN GOTO SQFAIL
ALLOC FI(SYSUDUMP) SYSOUT(A) BLKSIZE(132)
IF &LASTCC NE 0 THEN GOTO SQFAIL
ALLOC FI(TRANDUMP) SYSOUT(A) USING(SQ132)
IF &LASTCC NE 0 THEN GOTO SQFAIL
ALLOC FI(AUXTRC) SYSOUT(A) USING(SQTRC)
IF &LASTCC NE 0 THEN GOTO SQFAIL
ALLOC FI(SYSI) DUMMY USING(SQ80)
IF &LASTCC NE 0 THEN GOTO SQFAIL
ALLOC FI(SYSO) SYSOUT(A) USING(SQ80)
IF &LASTCC NE 0 THEN GOTO SQFAIL
WRITE PF3 LEAVES SQLS ONLY. USE K999 TO END KICKS AND RETURN TO TSO.
CALL 'IBMUSER.SQLITE.D534.LOAD(KIKSIP1$)' +
 'SIT=1$ PCT=SQ PPT=SQ TCP=2$ ICVR=0'
SET KRC=&LASTCC
GOTO SQDONE
SQFAIL: +
SET KRC=&LASTCC
WRITE SQLITE KICKS ALLOCATION FAILED, RC=&KRC
SQDONE: +
CONTROL NOMSG NOFLUSH
FREE FI(SKIKLOAD KIKRPL SQLDB SQLJRN LICENSE SYSIN SYSTERM SYSPRINT)
FREE FI(SYSOUT SYSUDUMP TRANDUMP AUXTRC SYSI SYSO)
FREE AT(SQ80 SQ132 SQTRC)
WRITE SQLITE KICKS SESSION ENDED, RC=&KRC
EXIT CODE(&KRC)
