//SQLKCPY  JOB (ACCT),'SQLK START',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//COPY     EXEC PGM=IEBCOPY
//SYSPRINT DD SYSOUT=*
//IN       DD DSN=KICKS.KICKSSYS.V1R5M0.SKIKLOAD,DISP=SHR
//OUT      DD DSN=IBMUSER.SQLITE.LOAD,DISP=SHR
//SYSUT3   DD UNIT=SYSDA,SPACE=(TRK,(5,5))
//SYSUT4   DD UNIT=SYSDA,SPACE=(TRK,(5,5))
//SYSIN    DD *
 COPY INDD=IN,OUTDD=OUT
 SELECT MEMBER=((KIKSIP1$,,R))
/*
