//SQLTBKTS JOB (A),'BKTEST',CLASS=A,MSGCLASS=H
//RUN      EXEC PGM=SQLTTEST,PARM='BACKUP',REGION=4096K
//STEPLIB  DD DISP=SHR,DSN=IBMUSER.SQLITE.LOAD
//SQLDB    DD DISP=SHR,DSN=IBMUSER.SQLITE.RRDS
//SQLJRN   DD DISP=SHR,DSN=IBMUSER.SQLITE.JOURNAL
//SQLBAK   DD DISP=SHR,DSN=IBMUSER.SQLITE.BACKUP
//SQLBJR   DD DISP=SHR,DSN=IBMUSER.SQLITE.BACKJRN
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
