//SQLTBKTS JOB (A),'BKTEST',CLASS=A,MSGCLASS=H
//RUN      EXEC PGM=SQLT534,PARM='BACKUP',REGION=4096K
//STEPLIB  DD DISP=SHR,DSN=IBMUSER.SQLITE.D534.LOAD
//SQLDB    DD DISP=SHR,DSN=IBMUSER.SQLITE.D534DB
//SQLJRN   DD DISP=SHR,DSN=IBMUSER.SQLITE.D534JRN
//SQLBAK   DD DISP=SHR,DSN=IBMUSER.SQLITE.D534BAK
//SQLBJR   DD DISP=SHR,DSN=IBMUSER.SQLITE.D534BJR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
