//SQLASET  JOB (ACCT),'API SET',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE IBMUSER.SQLITE.BRG80 PURGE
  IF LASTCC = 8 THEN SET MAXCC = 0
/*
//ALLOC    EXEC PGM=IEFBR14,COND=(0,NE)
//BRIDGE   DD DSN=IBMUSER.SQLITE.BRG80,DISP=(NEW,CATLG,DELETE),
// UNIT=SYSDA,SPACE=(TRK,(1,1)),DCB=(RECFM=FB,LRECL=80,BLKSIZE=3200)
