//SQLTDB   JOB (ACCT),'TESTDB',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//DEFINE   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE IBMUSER.SQLITE.TESTDB CLUSTER PURGE
  IF LASTCC = 8 THEN SET MAXCC = 0
  DEFINE CLUSTER (NAME(IBMUSER.SQLITE.TESTDB) -
          NUMBERED -
          RECORDSIZE(4096 4096) -
          TRACKS(20 10) -
          VOLUMES(TSO003) -
          UNIQUE -
          SPEED -
          SHAREOPTIONS(3 3)) -
        DATA (NAME(IBMUSER.SQLITE.TESTDB.DATA))
  DELETE IBMUSER.SQLITE.TESTJRN CLUSTER PURGE
  IF LASTCC = 8 THEN SET MAXCC = 0
  DEFINE CLUSTER (NAME(IBMUSER.SQLITE.TESTJRN) -
          NUMBERED -
          RECORDSIZE(4096 4096) -
          TRACKS(10 5) -
          VOLUMES(TSO003) -
          UNIQUE -
          SPEED -
          SHAREOPTIONS(3 3)) -
        DATA (NAME(IBMUSER.SQLITE.TESTJRN.DATA))
/*
//SEED     EXEC PGM=SQLTTEST,PARM='SEED',REGION=4096K,COND=(0,NE)
//STEPLIB  DD DISP=SHR,DSN=IBMUSER.SQLITE.LOAD
//SQLDB    DD DISP=SHR,DSN=IBMUSER.SQLITE.TESTDB
//SQLJRN   DD DISP=SHR,DSN=IBMUSER.SQLITE.TESTJRN
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
