//NEWDB    JOB (ACCT),'SQL DB',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//* Replace YOURID, MYDB, MYJRN, and optionally VOLUMES/TRACKS.
//DEFINE   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE YOURID.SQLITE.MYDB CLUSTER PURGE
  IF LASTCC = 8 THEN SET MAXCC = 0
  DEFINE CLUSTER (NAME(YOURID.SQLITE.MYDB) -
          NUMBERED -
          RECORDSIZE(4096 4096) -
          TRACKS(20 10) -
          VOLUMES(TSO003) -
          UNIQUE -
          SPEED -
          SHAREOPTIONS(3 3)) -
        DATA (NAME(YOURID.SQLITE.MYDB.DATA))
  DELETE YOURID.SQLITE.MYJRN CLUSTER PURGE
  IF LASTCC = 8 THEN SET MAXCC = 0
  DEFINE CLUSTER (NAME(YOURID.SQLITE.MYJRN) -
          NUMBERED -
          RECORDSIZE(4096 4096) -
          TRACKS(10 5) -
          VOLUMES(TSO003) -
          UNIQUE -
          SPEED -
          SHAREOPTIONS(3 3)) -
        DATA (NAME(YOURID.SQLITE.MYJRN.DATA))
/*
