//SQLT534D JOB (ACCT),'DEFINE 353',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//IDCAMS   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE IBMUSER.SQLITE.D534DB CLUSTER PURGE
  IF LASTCC = 8 THEN SET MAXCC = 0
  DEFINE CLUSTER (NAME(IBMUSER.SQLITE.D534DB) -
          NUMBERED -
          RECORDSIZE(4096 4096) -
          TRACKS(10 5) -
          VOLUMES(TSO003) -
          UNIQUE -
          SPEED -
          SHAREOPTIONS(3 3)) -
        DATA (NAME(IBMUSER.SQLITE.D534DB.DATA))
  DELETE IBMUSER.SQLITE.D534JRN CLUSTER PURGE
  IF LASTCC = 8 THEN SET MAXCC = 0
  DEFINE CLUSTER (NAME(IBMUSER.SQLITE.D534JRN) -
          NUMBERED -
          RECORDSIZE(4096 4096) -
          TRACKS(10 5) -
          VOLUMES(TSO003) -
          UNIQUE -
          SPEED -
          SHAREOPTIONS(3 3)) -
        DATA (NAME(IBMUSER.SQLITE.D534JRN.DATA))
/*
