//SQLTDEF JOB (ACCT),'SQLITE RRDS',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//IDCAMS   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE IBMUSER.SQLITE.RRDS CLUSTER PURGE
  IF LASTCC = 8 THEN SET MAXCC = 0
  DEFINE CLUSTER (NAME(IBMUSER.SQLITE.RRDS) -
          NUMBERED -
          RECORDSIZE(4096 4096) -
          TRACKS(10 5) -
          VOLUMES(TSO003) -
          UNIQUE -
          SPEED -
          SHAREOPTIONS(3 3)) -
        DATA (NAME(IBMUSER.SQLITE.RRDS.DATA))
  DELETE IBMUSER.SQLITE.JOURNAL CLUSTER PURGE
  IF LASTCC = 8 THEN SET MAXCC = 0
  DEFINE CLUSTER (NAME(IBMUSER.SQLITE.JOURNAL) -
          NUMBERED -
          RECORDSIZE(4096 4096) -
          TRACKS(10 5) -
          VOLUMES(TSO003) -
          UNIQUE -
          SPEED -
          SHAREOPTIONS(3 3)) -
        DATA (NAME(IBMUSER.SQLITE.JOURNAL.DATA))
/*
