//SQLTVACD JOB (ACCT),'VACUUM RRDS',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//DEFINE   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE IBMUSER.SQLITE.D534TMP CLUSTER PURGE
  IF LASTCC = 8 THEN SET MAXCC = 0
  DEFINE CLUSTER (NAME(IBMUSER.SQLITE.D534TMP) -
          NUMBERED -
          RECORDSIZE(4096 4096) -
          TRACKS(30 15) -
          VOLUMES(TSO003) -
          UNIQUE -
          SPEED -
          SHAREOPTIONS(3 3)) -
        DATA (NAME(IBMUSER.SQLITE.D534TMP.DATA))
  DELETE IBMUSER.SQLITE.D534TJR CLUSTER PURGE
  IF LASTCC = 8 THEN SET MAXCC = 0
  DEFINE CLUSTER (NAME(IBMUSER.SQLITE.D534TJR) -
          NUMBERED -
          RECORDSIZE(4096 4096) -
          TRACKS(15 5) -
          VOLUMES(TSO003) -
          UNIQUE -
          SPEED -
          SHAREOPTIONS(3 3)) -
        DATA (NAME(IBMUSER.SQLITE.D534TJR.DATA))
/*
