//SQLTBKUP JOB (A),'BACKUP',CLASS=A,MSGCLASS=H
//* WARNING: THIS DELETES AND RECREATES THE BACKUP RRDS PAIR.
//IDCAMS   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE IBMUSER.SQLITE.D534BAK CLUSTER PURGE
  IF LASTCC = 8 THEN SET MAXCC = 0
  DEFINE CLUSTER (NAME(IBMUSER.SQLITE.D534BAK) -
          NUMBERED -
          RECORDSIZE(4096 4096) -
          TRACKS(20 10) -
          VOLUMES(TSO003) -
          UNIQUE -
          SPEED -
          SHAREOPTIONS(3 3)) -
        DATA (NAME(IBMUSER.SQLITE.D534BAK.DATA))
  DELETE IBMUSER.SQLITE.D534BJR CLUSTER PURGE
  IF LASTCC = 8 THEN SET MAXCC = 0
  DEFINE CLUSTER (NAME(IBMUSER.SQLITE.D534BJR) -
          NUMBERED -
          RECORDSIZE(4096 4096) -
          TRACKS(10 5) -
          VOLUMES(TSO003) -
          UNIQUE -
          SPEED -
          SHAREOPTIONS(3 3)) -
        DATA (NAME(IBMUSER.SQLITE.D534BJR.DATA))
/*
