//SQLETST  JOB (A),'EXEC SQL',CLASS=A,MSGCLASS=H
//COB      EXEC PGM=IKFCBL00,PARM='LOAD,DMAP,LIB,SIZE=2048K,BUF=1024K'
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSDA,SPACE=(460,(700,100))
//SYSUT2   DD UNIT=SYSDA,SPACE=(460,(700,100))
//SYSUT3   DD UNIT=SYSDA,SPACE=(460,(700,100))
//SYSUT4   DD UNIT=SYSDA,SPACE=(460,(700,100))
//SYSLIN   DD DSN=&&COBOBJ,DISP=(NEW,PASS),UNIT=SYSDA,
// SPACE=(TRK,(5,5)),DCB=(RECFM=FB,LRECL=80,BLKSIZE=3200)
//SYSLIB   DD DISP=SHR,DSN=KICKS.KICKS.V1R5M0.COBCOPY
//SYSPUNCH DD DUMMY
//SYSIN    DD DSN=IBMUSER.SQLITE.SOURCE(SQLETST),DISP=SHR
//GO       EXEC PGM=LOADER,PARM='MAP,NOLET',REGION=4096K,
//         COND=(4,LT,COB)
//STEPLIB  DD DISP=SHR,DSN=IBMUSER.SQLITE.D534.LOAD
//SYSLIN   DD DSN=&&COBOBJ,DISP=(OLD,DELETE)
//         DD DISP=SHR,DSN=IBMUSER.SQLITE.BRG80
//SYSLIB   DD DISP=SHR,DSN=SYS1.COBLIB
//SYSLOUT  DD SYSOUT=*
//SQLDB    DD DISP=SHR,DSN=IBMUSER.SQLITE.TESTDB
//SQLJRN   DD DISP=SHR,DSN=IBMUSER.SQLITE.TESTJRN
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
