//SQLTPRNT JOB (ACCT),'SQLITE RRDS',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//IDCAMS   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  PRINT INDATASET(IBMUSER.SQLITE.D534DB) HEX COUNT(1)
/*
