//SQLTSUIT JOB (ACCT),'SUITE',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//RUN      EXEC PGM=SQLTTEST,PARM='SUITE',REGION=4096K
//STEPLIB  DD DISP=SHR,DSN=IBMUSER.SQLITE.LOAD
//SQLDB    DD DISP=SHR,DSN=IBMUSER.SQLITE.RRDS
//SQLJRN   DD DISP=SHR,DSN=IBMUSER.SQLITE.JOURNAL
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
