//SQLTSUIT JOB (ACCT),'SUITE',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//RUN      EXEC PGM=SQLT534,PARM='SUITE',REGION=4096K
//STEPLIB  DD DISP=SHR,DSN=IBMUSER.SQLITE.D534.LOAD
//SQLDB    DD DISP=SHR,DSN=IBMUSER.SQLITE.D534DB
//SQLJRN   DD DISP=SHR,DSN=IBMUSER.SQLITE.D534JRN
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
