//SQLT372T JOB (ACCT),'337 SUITE',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//RUN      EXEC PGM=SQLT372,PARM='SUITE',REGION=4096K
//STEPLIB  DD DISP=SHR,DSN=IBMUSER.SQLITE.D372.LOAD
//SQLDB    DD DISP=SHR,DSN=IBMUSER.SQLITE.D372DB
//SQLJRN   DD DISP=SHR,DSN=IBMUSER.SQLITE.D372JRN
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
