      * SQLite MVS COBOL API v1 linkage contract
       01  SQLA-SQL-LENGTH       PIC S9(4) COMP.
       01  SQLA-SQL              PIC X(4096).
       01  SQLA-OUTPUT-LENGTH    PIC S9(4) COMP.
       01  SQLA-OUTPUT           PIC X(9999).
       01  SQLA-OUTPUT-CAPACITY  PIC S9(4) COMP VALUE +9999.
       01  SQLA-RETURN-CODE      PIC S9(4) COMP.
